import numpy as np

INTER_COMM = "inter_comm"
INTRA_COMM = "intra_comm"
MIXED_COMM = "mixed_comm"

# 都在对应的group中进行通信操作，有明显的 inter-comm 和 intra-comm的区别
# TP/EP ALLREDUCE: intra-commm, 同一host内的allreduce（group_size<8）
# DP ALLREDUCE: inter-comm, 跨NIC的allreduce
# PP SEND_RECV: inter-comm, 跨NIC的send/recv

# 64卡 单位us
NCCL_COMM_DB = {
    INTER_COMM: {
        'send_recv': {
            2: {
                1024: 102,
                100663296: 273402.32,
            },
        }, 
        'allreduce_ring': {
        },
        'reduce_scatter': {
        },
        'allgather': {
        },
    },
    INTRA_COMM:{
        'send_recv': {
            2: {
                2048: 101.07,
                10485760: 190.21
            },
        }, 
        'allreduce_ring': {
            2: {
                1024: 11.03,
                65536: 25.89,
                262144: 50.21,
                524288: 52.29,
                1048576: 66.56,
                2097152: 75.95,
                4194304: 88.87,
                8388608: 118.7,
                16777216: 159.4,
                33554432: 261.8,
                67108864: 418.4,
                134217728: 742.2,
                268435456: 2390.6,
                6509404160: 61920.5
            },
            4: {
                1024: 15.98,
                65536: 26.26,
                262144: 43.42,
                524288: 58.14,
                1048576: 75.07,
                2097152: 83.36,
                4194304: 102.9,
                8388608: 148.2,
                16777216: 222.8,
                33554432: 310.4,
                67108864: 555.1,
                134217728: 998.9,
                268435456: 1939.3
            },
            # 8: {
            #     1024: 34.07,
            #     65536: 37.07,
            #     262144: 47.60,
            #     524288: 50.58,
            #     1048576: 78.63,
            #     2097152: 100.3,
            #     4194304: 122.9,
            #     8388608: 181.5,
            #     16777216: 286.5,
            #     33554432: 413.3,
            #     67108864: 657.3,
            #     134217728: 1308.7,
            #     268435456: 2393.0
            # },
            8: {
                1024: 34.07,
                65536: 37.07,
                262144: 47.60,
                524288: 50.58,
                1048576: 78.63,
                2097152: 100.3,
                4194304: 122.9,
                8388608: 181.5,
                16777216: 286.5,
                33554432: 413.3,
                67108864: 7890.2,
                100663296: 13080.7,
                134217728: 16308.1,
                268435456: 32308.3
            },
        },
        'reduce_scatter': {
        },
        'allgather': {
        },
    },
    MIXED_COMM:{
        # 96卡100663296: 273402.32*1.3,
        # 64卡100663296: 273402.32*1.77
        'send_recv': {
            2: {
                2048: 101.07,
                10485760: 190.21,
                100663296: 273402.32*1.82,
            },
        }, 
        'allreduce_ring': {
            2: {
                1024: 11.03,
                65536: 25.89,
                262144: 50.21,
                524288: 52.29,
                1048576: 66.56,
                2097152: 75.95,
                4194304: 88.87,
                8388608: 118.7,
                16777216: 159.4,
                33554432: 261.8,
                67108864: 418.4,
                134217728: 742.2,
                268435456: 2390.6,
                6509404160: 61920.5
            },
            # 4: {
            #     1024: 15.98,
            #     65536: 26.26,
            #     262144: 43.42,
            #     524288: 58.14,
            #     1048576: 75.07,
            #     2097152: 83.36,
            #     4194304: 102.9,
            #     8388608: 148.2,
            #     16777216: 222.8,
            #     33554432: 310.4,
            #     67108864: 555.1,
            #     134217728: 998.9,
            #     268435456: 1939.3
            # },
            4: {
                1024: 34.07,
                65536: 37.07,
                262144: 47.60,
                524288: 50.58,
                1048576: 78.63,
                2097152: 100.3,
                4194304: 122.9,
                8388608: 181.5,
                16777216: 286.5,
                33554432: 413.3,
                67108864: 7890.2,
                100663296: 13080.7*1.7,
                134217728: 16308.1*1.7,
                268435456: 32308.3*1.7
            },
            # 8: {
            #     1024: 34.07,
            #     65536: 37.07,
            #     262144: 47.60,
            #     524288: 50.58,
            #     1048576: 78.63,
            #     2097152: 100.3,
            #     4194304: 122.9,
            #     8388608: 181.5,
            #     16777216: 286.5,
            #     33554432: 413.3,
            #     67108864: 657.3,
            #     134217728: 1308.7,
            #     268435456: 2393.0
            # },
            8: {
                1024: 34.07,
                65536: 37.07,
                262144: 47.60,
                524288: 50.58,
                1048576: 78.63,
                2097152: 100.3,
                4194304: 122.9,
                8388608: 181.5,
                16777216: 286.5,
                33554432: 413.3,
                67108864: 7890.2,
                100663296: 13080.7*1.7,
                134217728: 16308.1*1.7,
                268435456: 32308.3*1.7
            },
            16: {
            },
            32: {
            }
        },
        'allreduce_tree': {
        },
        'reduce_scatter': {
        },
        'allgather': {
        },
    }

}



# 96卡 
# NCCL_COMM_DB = {
#     INTER_COMM: {
#         'send_recv': {
#             2: {
#                 1024: 102,
#                 100663296: 273402.32,
#             },
#         }, 
#         'allreduce_ring': {
#         },
#         'reduce_scatter': {
#         },
#         'allgather': {
#         },
#     },
#     INTRA_COMM:{
#         'send_recv': {
#             2: {
#                 2048: 101.07,
#                 10485760: 190.21
#             },
#         }, 
#         'allreduce_ring': {
#             2: {
#                 1024: 11.03,
#                 65536: 25.89,
#                 262144: 50.21,
#                 524288: 52.29,
#                 1048576: 66.56,
#                 2097152: 75.95,
#                 4194304: 88.87,
#                 8388608: 118.7,
#                 16777216: 159.4,
#                 33554432: 261.8,
#                 67108864: 418.4,
#                 134217728: 742.2,
#                 268435456: 2390.6,
#                 6509404160: 61920.5
#             },
#             4: {
#                 1024: 15.98,
#                 65536: 26.26,
#                 262144: 43.42,
#                 524288: 58.14,
#                 1048576: 75.07,
#                 2097152: 83.36,
#                 4194304: 102.9,
#                 8388608: 148.2,
#                 16777216: 222.8,
#                 33554432: 310.4,
#                 67108864: 555.1,
#                 134217728: 998.9,
#                 268435456: 1939.3
#             },
#             # 8: {
#             #     1024: 34.07,
#             #     65536: 37.07,
#             #     262144: 47.60,
#             #     524288: 50.58,
#             #     1048576: 78.63,
#             #     2097152: 100.3,
#             #     4194304: 122.9,
#             #     8388608: 181.5,
#             #     16777216: 286.5,
#             #     33554432: 413.3,
#             #     67108864: 657.3,
#             #     134217728: 1308.7,
#             #     268435456: 2393.0
#             # },
#             8: {
#                 1024: 34.07,
#                 65536: 37.07,
#                 262144: 47.60,
#                 524288: 50.58,
#                 1048576: 78.63,
#                 2097152: 100.3,
#                 4194304: 122.9,
#                 8388608: 181.5,
#                 16777216: 286.5,
#                 33554432: 413.3,
#                 67108864: 7890.2,
#                 100663296: 13080.7,
#                 134217728: 16308.1,
#                 268435456: 32308.3
#             },
#         },
#         'reduce_scatter': {
#         },
#         'allgather': {
#         },
#     },
#     MIXED_COMM:{
#         # 96卡100663296: 273402.32*1.3,
#         # 64卡100663296: 273402.32*1.77
#         'send_recv': {
#             2: {
#                 2048: 101.07,
#                 10485760: 190.21,
#                 100663296: 273402.32*1.3,
#             },
#         }, 
#         'allreduce_ring': {
#             2: {
#                 1024: 11.03,
#                 65536: 25.89,
#                 262144: 50.21,
#                 524288: 52.29,
#                 1048576: 66.56,
#                 2097152: 75.95,
#                 4194304: 88.87,
#                 8388608: 118.7,
#                 16777216: 159.4,
#                 33554432: 261.8,
#                 67108864: 418.4,
#                 134217728: 742.2,
#                 268435456: 2390.6,
#                 6509404160: 61920.5
#             },
#             # 4: {
#             #     1024: 15.98,
#             #     65536: 26.26,
#             #     262144: 43.42,
#             #     524288: 58.14,
#             #     1048576: 75.07,
#             #     2097152: 83.36,
#             #     4194304: 102.9,
#             #     8388608: 148.2,
#             #     16777216: 222.8,
#             #     33554432: 310.4,
#             #     67108864: 555.1,
#             #     134217728: 998.9,
#             #     268435456: 1939.3
#             # },
#             4: {
#                 1024: 34.07,
#                 65536: 37.07,
#                 262144: 47.60,
#                 524288: 50.58,
#                 1048576: 78.63,
#                 2097152: 100.3,
#                 4194304: 122.9,
#                 8388608: 181.5,
#                 16777216: 286.5,
#                 33554432: 413.3,
#                 67108864: 7890.2,
#                 100663296: 13080.7*1.7,
#                 134217728: 16308.1*1.7,
#                 268435456: 32308.3*1.7
#             },
#             # 8: {
#             #     1024: 34.07,
#             #     65536: 37.07,
#             #     262144: 47.60,
#             #     524288: 50.58,
#             #     1048576: 78.63,
#             #     2097152: 100.3,
#             #     4194304: 122.9,
#             #     8388608: 181.5,
#             #     16777216: 286.5,
#             #     33554432: 413.3,
#             #     67108864: 657.3,
#             #     134217728: 1308.7,
#             #     268435456: 2393.0
#             # },
#             8: {
#                 1024: 34.07,
#                 65536: 37.07,
#                 262144: 47.60,
#                 524288: 50.58,
#                 1048576: 78.63,
#                 2097152: 100.3,
#                 4194304: 122.9,
#                 8388608: 181.5,
#                 16777216: 286.5,
#                 33554432: 413.3,
#                 67108864: 7890.2,
#                 100663296: 13080.7*1.7,
#                 134217728: 16308.1*1.7,
#                 268435456: 32308.3*1.7
#             },
#             16: {
#             },
#             32: {
#             }
#         },
#         'allreduce_tree': {
#         },
#         'reduce_scatter': {
#         },
#         'allgather': {
#         },
#     }

# }


def get_across_comm_type_and_comm_func(comm_group:list, comm_func:str):
    across_comm_type = None
    across_comm_type = MIXED_COMM

    # print(f"comm_group:{comm_group}, comm_func:{comm_func}")

    if comm_func == "recv_forward" or comm_func == "send_forward" or comm_func == "recv_backward" or comm_func == "send_backward" or comm_func == "send_recv":
        comm_func = "send_recv"

    elif "allreduce" in comm_func:
        if len(comm_group) < 16:
            comm_func = "allreduce_ring"
        else:
            comm_func = "allreduce_tree"
    
    # TODO：暂时支持的几种comm
    if comm_func not in ["allreduce_tree", "allreduce_ring", "send_recv"]:
        raise ValueError(f"comm_func:{comm_func} not supported")

    if ("tp" in comm_func or "ep") in comm_func and len(comm_group) <= 8:
        across_comm_type = INTRA_COMM

    return across_comm_type, comm_func


def get_comm_op_exc_time(comm_group:list, data_size:int, comm_func:str):
    assert isinstance(comm_group, list), "comm_group should be a list"

    global NCCL_COMM_DB
    gpu_num = len(comm_group)

    # 不存在通信操作
    if gpu_num == 1:
        return 0.01
    
    across_comm_type, comm_func = get_across_comm_type_and_comm_func(comm_group, comm_func)
    # TODO:p2p时group大小是否影响通信时间？
    if comm_func == "send_recv":
        gpu_num = 2

    # TODO:gpu_num的近似处理
    assert comm_func in NCCL_COMM_DB[across_comm_type], f"{comm_func} not in NCCL_COMM_DB"
    assert gpu_num in NCCL_COMM_DB[across_comm_type][comm_func], f"{gpu_num} not in NCCL_COMM_DB"

    if data_size not in NCCL_COMM_DB[across_comm_type][comm_func][gpu_num]:
        keys = np.array(list(NCCL_COMM_DB[across_comm_type][comm_func][gpu_num].keys()))
        values = np.array(list(NCCL_COMM_DB[across_comm_type][comm_func][gpu_num].values()))
        
        if data_size < keys.min():
            estimated_value = values[keys.argmin()]
        elif data_size > keys.max():
            estimated_value = values[keys.argmax()]
        else:
            lower_idx = np.max(np.where(keys <= data_size))
            upper_idx = np.min(np.where(keys >= data_size))
            
            lower_key = keys[lower_idx]
            upper_key = keys[upper_idx]
            
            lower_value = values[lower_idx]
            upper_value = values[upper_idx]

            # 使用线性插值
            estimated_value = lower_value + (upper_value - lower_value) * (data_size - lower_key) / (upper_key - lower_key)
            NCCL_COMM_DB[across_comm_type][comm_func][gpu_num][data_size] = estimated_value
    else:
        estimated_value = NCCL_COMM_DB[across_comm_type][comm_func][gpu_num][data_size]
    
    return round(estimated_value/1000,2) # us to ms




